{
  "magic": "E!vIA5L86J2I",
  "timestamp": "2025-12-18T01:13:56.035452+00:00",
  "repo": "lamps-wg/cms-composite-sigs",
  "labels": [
    {
      "name": "bug",
      "description": "Something isn't working",
      "color": "d73a4a"
    },
    {
      "name": "documentation",
      "description": "Improvements or additions to documentation",
      "color": "0075ca"
    },
    {
      "name": "duplicate",
      "description": "This issue or pull request already exists",
      "color": "cfd3d7"
    },
    {
      "name": "enhancement",
      "description": "New feature or request",
      "color": "a2eeef"
    },
    {
      "name": "good first issue",
      "description": "Good for newcomers",
      "color": "7057ff"
    },
    {
      "name": "help wanted",
      "description": "Extra attention is needed",
      "color": "008672"
    },
    {
      "name": "invalid",
      "description": "This doesn't seem right",
      "color": "e4e669"
    },
    {
      "name": "question",
      "description": "Further information is requested",
      "color": "d876e3"
    },
    {
      "name": "wontfix",
      "description": "This will not be worked on",
      "color": "ffffff"
    }
  ],
  "issues": [
    {
      "number": 2,
      "id": "I_kwDOQdmGXs7deMjT",
      "title": "Proposal amendments to (missing) Section 8 (CMS) v. 2",
      "url": "https://github.com/lamps-wg/cms-composite-sigs/issues/2",
      "state": "OPEN",
      "author": "PiotrPopis",
      "authorAssociation": "NONE",
      "assignees": [],
      "labels": [],
      "body": "@ounsworth @janklaussner @johngray-dev \n\nIssue #135 concerns version 4 composite-signs, hence it is outdated and should be closed. That issue is an updated version of the deleted chapter 8 on CMS, but includes mechanisms appropriate for version 7.\nI hope it will be useful for the authors of \"Composite ML-DSA in the CMS\".\n\n1. CMS (SignedData) structures contain different values depending on whether signed attributes are present (the typical case) or absent. \n2. In the absence of signed attributes one of the hash function: SHA256, SHA512 or SHAKE256/512 is used to calculate PH(M) and the creation of M'. Message M is contained in the SignedData.encapContentInfo.eContent OCTET STRING (without the tag and the length octets – see the first paragraph in Section 5.4 RFC 5652) field. The ML-DSA component does not use any additional \"external\" hash function (in CMS we use PURE mode only), and only the traditional component uses it towards M’. \n3. In case of signed attributes, the message digest of the eContent field is generated in the first step and it is the value of the messageDigest attribute. Then a message M is created from the signedAttrs field, including the tag and the length octets. In the next step, a message M' is created, which among other things contains the element PH(M), which is a digest of the message M, created using one of the digest functions, similarly as when the absence of signed attributes. According to Section 11.2 of RFC 5652, the hash function specified in the SignerInfo.digestAlgorithm field MUST be used.\n4. The ML-DSA component computes a signature of the message M’ using its “internal” digest function (PURE mode). The traditional component computes a digest of the message M’ using “their” digest function, and then signs the data. According to RFC 8933 RSA and ECDSA algorithms use the same digest function, while EdDSA uses \"internal\" digest functions. It should be added that according to section 3.2 of RFC 8419, the algorithms: Ed25519 and Ed448 use the SHA512 and SHAKE256 hash functions respectively, but these hash functions are used as part of the private key signing operation (these are not \"external\" hash functions, although their identifiers are placed in the digestAlgorithm field of the SignerInfo sequence – see Table 2 below).\n5. I would like to point out that in the case of RSA and ECDSA there is an inconsistency with RFC 8933 for the following compositions:\n•\tid-MLDSA65-RSA3072-PSS-SHA512,\n•\tid-MLDSA65-RSA3072-PKCS15-SHA512,\n•\tid-MLDSA65-RSA4096-PSS-SHA512,\n•\tid-MLDSA65-RSA4096-PKCS15-SHA512,\n•\tid-MLDSA65-ECDSA-P256-SHA512,\n•\tid-MLDSA65-ECDSA-P384-SHA512,\n•\tid-MLDSA65-ECDSA-brainpoolP256r1-SHA512,\n•\tid-MLDSA87-ECDSA-P384-SHA512,\n•\tid-MLDSA87-ECDSA-brainpoolP384r1-SHA512,\n•\tid-MLDSA87-RSA3072-PSS-SHA512,\n•\tid-MLDSA87-RSA4096-PSS-SHA512.\nAlthough the appropriate hash algorithms would be clearly specified in the “Composite ML-DSA in the CMS”, so \"algorithm substitution attack\", which was the reason for the clarification in RFC 8933, is not possible.\n6. In the SignedData structure, in the SignerInfo sequence, the digestAlgorithm field indicates the hash function used in the given electronic signature scheme – see section 5.3 of RFC 5652. In the case of composite signatures, there is a problem with using a single digestAlgorithm field to indicate - usually - two different hash functions: for the generation of PH(M) and for the traditional algorithm.\n7. It is essential to maintain compliance of “Composite ML-DSA in the CMS” with the relevant CMS standardization documents for individual components (algorithms): RFC 5753 (ECDSA), RFC 8419 (Ed25519/Ed448), RFC 5652/RFC 8933 and RFC 8017 (RSA-PKCS15 and RSA-PSS (although without RSASSA-PSS-params) and draft-ietf-lamps-cms-ml-dsa-05 (ML-DSA):\nTable 1: SignedData.digestAlgorithms field in accordance with standards\n<img width=\"945\" height=\"188\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/ea68fada-99a3-4623-8c9c-4b1c6f500078\" />\n\nTable 2: SignerInfo.digestAlgorithm field in accordance with standards\n<img width=\"945\" height=\"495\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/d3c521b0-55c2-4d8e-898b-fa86a45c8999\" />\n8. In my opinion, in “Composite ML-DSA in the CMS” we should:\n•\tSignedData.digestAlgorithms field – leave the general reference to RFC 5652 (i.e. optionally the set of algorithms), but with the recommendation to include the hashing algorithms when filling this field: for calculating messageDigest attribute (in case of signed attributes exist), PH(M) and the algorithm used by the traditional component, if they are different.\n•\tSignerInfo.digestAlgorithm field – place the algorithm from the “Pre-Hash” column in Table 2: ML-DSA Composite Signature Algorithms for calculating messageDigest attribute (in case of signed attributes exist) and PH(M), specifying that in the case of the traditional component, the hashing function used is indicated indirectly using “Trad” column in this Table 2.\n9. The tables below contain relevant clarifications:\n<img width=\"945\" height=\"853\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/7ee742f3-50c1-45f2-8ac0-9a22dab8076f\" />\n<img width=\"945\" height=\"919\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/567689c5-bd7b-4764-b4fb-b1f2f3fff16d\" />\n10. To summarize, my proposal for the deleted chapter 8 \"Use in CMS\" is as follows:\n(I hope it will be useful for the authors of \"Composite ML-DSA in the CMS\")\n8. Use in CMS\n   Composite Signature algorithms MAY be employed for one or more\n   recipients in the CMS signed-data content type [RFC5652].\n\n   All recommendations for using Composite ML-DSA in CMS are fully\n   aligned with the use of ML-DSA in CMS [I-D.ietf-lamps-cms-ml-dsa].\n\n8.1.  Underlying Components\n\nThis specification does not list any particular composite algorithm as mandatory-to-implement, however organizations that operate within specific application domains are encouraged to define profiles that select a small number of composites appropriate for that application domain. For applications that do not have any regulatory requirements or legacy implementations to consider, it is RECOMMENDED to focus implementation effort on:\nid-MLDSA65-ECDSA-P256-SHA512\n\nIn applications that require RSA, it is RECOMMENDED to focus implementation effort on:\nid-MLDSA65-RSA3072-PSS-SHA512\n\nIn applications that only allow NIST PQC Level 5, it is RECOMMENDED to focus implementation effort on:\nid-MLDSA87-ECDSA-P384-SHA512  \n\n8.2.  SignedData Conventions\n\n   As specified in CMS [RFC5652], the digital signature is produced from\n   the message digest and the signer's private key.  The signature is\n   computed over different values depending on whether signed attributes\n   are absent or present.\n\n   When signed attributes are absent, the composite signature is\n   computed over the content of the signed-data.  The \"content\" of a\n   signed-data is the value of the encapContentInfo eContent OCTET\n   STRING.  The tag and length octets are not included.  When signed\n   attributes are present, a hash is computed over the content using one of the following \n   hash function: SHA256, SHA512 or SHAKE256/512, and then a message-digest\n   attribute is constructed to contain the resulting hash value, and\n   then the result of DER encoding the set of signed attributes, which\n   MUST include at least a content-type attribute and a message-digest attribute,\n   and then the composite signature is computed over the DER-encoded\n   output.  In summary:\n\n   IF (signed attributes are absent)\n      THEN Composite-ML-DSA.Sign(content)\n   ELSE message-digest attribute = Hash(content);\n      Composite-ML-DSA.Sign(DER(SignedAttributes))\n\n  When using Composite Signatures, the SignedData.digestAlgorithms field\n  includes the identifiers of the digest algorithms used by one or more signer.\n  There MAY be any number of elements in the collection, including zero.  When\n   signing with Composite Signatures, that field SHOULD include OID’s of the\n   algorithms for calculating messageDigest attribute (in case of signed attributes\n   exist), PH(M) and the algorithm used by the traditional component, if they are\n   different,  and if present, the algorithm parameters field MUST be absent.  \n\n  When using Composite Signatures, the fields in the SignerInfo are\n   used as follows:\n\n   digestAlgorithm: Per Section 5.3 of [RFC5652], the digestAlgorithm\n   contains the one-way hash function used by the CMS signer.  In case of composite\n   signatures that field contains hash function from the “Pre-Hash” column in Table 2: \n   ML-DSA Composite Signature Algorithms [draft-ietf-lamps-pq-composite-sigs-07] \n   for calculating messageDigest attribute (in case of signed attributes exist) and for \n   calculating PH(M), i.e. hash of the eContent when signed attributes are absent or\n   hash of the signedAttrs when signed attributes are present. It should be emphasized\n   that in the case of the traditional component, the hashing function used is indicated\n   indirectly using “Trad” column in this Table 2 [draft-ietf-lamps-pq-composite-sigs-07].\nNote: in the case of RSA and ECDSA algorithms there is an inconsistency with RFC 8933 (i.e. a different hash function is used to calculate the messageDigest attribute and a different one to implement the signature), for the following compositions:\n•\tid-MLDSA65-RSA3072-PSS-SHA512,\n•\tid-MLDSA65-RSA3072-PKCS15-SHA512,\n•\tid-MLDSA65-RSA4096-PSS-SHA512,\n•\tid-MLDSA65-RSA4096-PKCS15-SHA512,\n•\tid-MLDSA65-ECDSA-P256-SHA512,\n•\tid-MLDSA65-ECDSA-P384-SHA512,\n•\tid-MLDSA65-ECDSA-brainpoolP256r1-SHA512,\n•\tid-MLDSA87-ECDSA-P384-SHA512,\n•\tid-MLDSA87-ECDSA-brainpoolP384r1-SHA512,\n•\tid-MLDSA87-RSA3072-PSS-SHA512,\n•\tid-MLDSA87-RSA4096-PSS-SHA512.\nAlthough the appropriate hash algorithms are clearly specified in this specification, so \"algorithm substitution attack”, which was the reason for the clarification in RFC 8933, is not possible – all hash functions are considered safe.\n\n   signatureAlgorithm: The signatureAlgorithm MUST contain one of the\n   the composite signature algorithm identifier as specified in the “OID”\n   column in Table 2: ML-DSA Composite Signature Algorithms [draft-ietf\n   -lamps-pq-composite-sigs-07] .\n\n   signature: The signature field contains the signature value resulting\n   from the composite signing operation of the specified signatureAlgorithm.\n\nThe following tables provide relevant explanations regarding the hash function:\n(…)\nTable x\n(...)\nTable y\n\n8.3.  Signature generation and verification\n\n   Composite signatures have a context string input that can be used to\n   ensure that different signatures are generated for different\n   application contexts.  When using composite signatures for CMS, the\n   context string used for generation M’ is the empty string, but for generation\n   ML-DSA component signature is always set to parameter “Domain”.\n\n\n\n\n",
      "createdAt": "2025-07-08T10:50:44Z",
      "updatedAt": "2025-12-17T14:10:38Z",
      "closedAt": null,
      "comments": [
        {
          "author": "danvangeest",
          "authorAssociation": "COLLABORATOR",
          "body": "@PiotrPopis I don't see any value in mentioning anything about the message digests associated with the traditional algorithms (except perhaps to mention that they're an implementation detail that doesn't affect Composite ML-DSA's use in CMS).\n\nSpecifically, we should not mention the trad digest algorithm in SignedData.digestAlgorithms.  Section 5.4 of RFC 5652 says \"The collection is intended to list the message digest algorithms employed by all of the signers, in any order, to facilitate one-pass signature verification.\"  Listing the trad algorithm would not facilitate one-pass signature verification.  Only the Composite ML-DSA algorithm's PH digest algorithm will help that.  The PH digest is put into Composite ML-DSA's M' and only the M' is signed by the trad algorithm (and ML-DSA).  Generating a trad digest at the CMS level won't help in calculating M', nor in signing M' with the signature algorithm.\n\nIt's also not worthwhile to point out the discrepency between the Composite ML-DSA PH algorithm and the tradtional pre-hash algorithm.  From the CMS perspective it's irrelevant, CMS is only generating a digest using the PH algorithm, what's done to create M' using PH and then signing it with the traditional algorithm is a detail of the Composite ML-DSA algorithm that doesn't affect CMS.",
          "createdAt": "2025-12-15T16:50:30Z",
          "updatedAt": "2025-12-15T16:50:30Z"
        },
        {
          "author": "PiotrPopis",
          "authorAssociation": "NONE",
          "body": "Hi All \r\nI don't argue, and I agree with Daniel Van Geest, that the CMS-Composite-MLDSA standard can omit information about message digests related to traditional algorithms. However, I recommend including tables in the document that clarify the use of all hash functions, i.e., tables similar to: \r\nTable x: Component's hash algorithms in CMS without signed attributes and \r\nTable y: Component's hash algorithms in CMS with signed attributes \r\nfrom [ https://github.com/lamps-wg/cms-composite-sigs/issues/2#issuecomment-3656653297 | (lamps-wg/cms-composite-sigs#2) ] \r\n\r\nRegards - Piotr Popis \r\n\r\nOd: \"janklaussner\" ***@***.***> \r\nDo: \"lamps-wg/cms-composite-sigs\" ***@***.***> \r\nDW: \"PiotrPopis\" ***@***.***>, \"Mention\" ***@***.***> \r\nWysłane: poniedziałek, 15 grudnia, 2025 17:50:53 \r\nTemat: Re: [lamps-wg/cms-composite-sigs] Proposal amendments to (missing) Section 8 (CMS) v. 2 (Issue #2) \r\n\r\ndanvangeest left a comment [ https://github.com/lamps-wg/cms-composite-sigs/issues/2#issuecomment-3656653297 | (lamps-wg/cms-composite-sigs#2) ] \r\n\r\n\r\n[ https://github.com/PiotrPopis | @PiotrPopis ] I don't see any value in mentioning anything about the message digests associated with the traditional algorithms (except perhaps to mention that they're an implementation detail that doesn't affect Composite ML-DSA's use in CMS). \r\n\r\nSpecifically, we should not mention the trad digest algorithm in SignedData.digestAlgorithms. Section 5.4 of RFC 5652 says \"The collection is intended to list the message digest algorithms employed by all of the signers, in any order, to facilitate one-pass signature verification.\" Listing the trad algorithm would not facilitate one-pass signature verification. Only the Composite ML-DSA algorithm's PH digest algorithm will help that. The PH digest is put into Composite ML-DSA's M' and only the M' is signed by the trad algorithm (and ML-DSA). Generating a trad digest at the CMS level won't help in calculating M', nor in signing M' with the signature algorithm. \r\n\r\nIt's also not worthwhile to point out the discrepency between the Composite ML-DSA PH algorithm and the tradtional pre-hash algorithm. From the CMS perspective it's irrelevant, CMS is only generating a digest using the PH algorithm, what's done to create M' using PH and then signing it with the traditional algorithm is a detail of the Composite ML-DSA algorithm that doesn't affect CMS. \r\n\r\n— \r\nReply to this email directly, [ https://github.com/lamps-wg/cms-composite-sigs/issues/2#issuecomment-3656653297 | view it on GitHub ] , or [ https://github.com/notifications/unsubscribe-auth/BLIOPUVVUJ6K2L4JUMJAZLL4B3RG3AVCNFSM6AAAAACOUDT5AKVHI2DSMVQWIX3LMV43OSLTON2WKQ3PNVWWK3TUHMZTMNJWGY2TGMRZG4 | unsubscribe ] . \r\nYou are receiving this because you were mentioned. Message ID: ***@***.***> \r\n\r\n",
          "createdAt": "2025-12-17T11:00:37Z",
          "updatedAt": "2025-12-17T11:00:37Z"
        },
        {
          "author": "danvangeest",
          "authorAssociation": "COLLABORATOR",
          "body": "@PiotrPopis what value would be added by including these tables?  This information about digest algorithms used by traditional components is available in draft-ietf-lamps-pq-composite-sigs, though not in table form, and anyone who is interested in that will be reading that document anyways.",
          "createdAt": "2025-12-17T14:10:38Z",
          "updatedAt": "2025-12-17T14:10:38Z"
        }
      ]
    }
  ],
  "pulls": [
    {
      "number": 1,
      "id": "PR_kwDOQdmGXs63yLqX",
      "title": "Rewrite",
      "url": "https://github.com/lamps-wg/cms-composite-sigs/pull/1",
      "state": "CLOSED",
      "author": "danvangeest",
      "authorAssociation": "COLLABORATOR",
      "assignees": [],
      "labels": [],
      "body": "",
      "createdAt": "2025-12-08T22:58:36Z",
      "updatedAt": "2025-12-15T13:26:05Z",
      "baseRepository": "lamps-wg/cms-composite-sigs",
      "baseRefName": "main",
      "baseRefOid": "a64c41482c388e7973b044f98a8143ad152e1898",
      "headRepository": "lamps-wg/cms-composite-sigs",
      "headRefName": "dvg/rewrite",
      "headRefOid": "8a07901bb9e93218aab1487c63edfaadf588cdf0",
      "closedAt": "2025-12-15T13:25:18Z",
      "mergedAt": null,
      "mergedBy": null,
      "mergeCommit": null,
      "comments": [],
      "reviews": []
    }
  ]
}